#include <stdio.h>
#include <stdlib.h>
 
/**
 * @brief Считывает с клавиатуры натуральное число
 * @return Считанное натуральное число
 */
int Nat();
 
/**
 * @brief Проверяет, является ли среднее арифметическое двух чисел целым
 * @param a первое натуральное число
 * @param b второе натуральное число
 * @return 1, если среднее арифметическое целое, иначе 0
 */
int Ar(const int a, const int b);
 
/**
 * @brief точка входа в программу
 * @return возвращает 0, если программа выполнена корректно, иначе не 0
 */
int main()
{
    printf("Введите первое натуральное число: \n");
    int a = Nat();
 
    printf("Введите второе натуральное число: \n");
    int b = Nat();
 
    printf("Среднее арифметическое: %.lf\n", (a + b) / 2.0);
    if (Ar(a, b))
        printf("Среднее арифметическое является целым числом.\n");
    else
        printf("Среднее арифметическое не является целым числом.\n");
 
    return 0;
}
 
int Nat()
{
    int value = 0;
    if (scanf("%d", &value) != 1 || value <= 0)
    {
        printf("Введено не натуральное число.\n");
        exit(1);
    }
    return value;
}
 
int Ar(const int a, const int b)
{
    return (a + b) % 2 == 0;
}
